43052391	300000000	
z_Replica_Ins_t_SaleD_300000000 300021800,3,600226,0,'пляш',1.000000000,569.666670000,569.666670000,113.933330000,113.933330000,683.600000000,683.600000000,'080480280017',1,569.666666670,113.933333330,683.600000000,83,0.000000000,0,1,0,1.000000000,10085,'2016-10-14T10:17:54.940','2016-10-14T10:17:54.940',0,683.600000000,683.600000000	2	
The transaction ended in the trigger. The batch has been aborted.  
Невозможно добавление данных в таблицу 'Продажа товара оператором: Продажи товара (t_SaleD)'. 
Отсутствуют данные в главной таблице 'Справочник товаров - Цены прихода Торговли (t_PInP)'.  
ВНИМАНИЕ!!! В t_PInP отсутствует товар 600226, Партия 0! Действие отменено.	2016-10-14 10:25:00.000

--проверка репликации на днепре
select * from [s-marketa].elitv_dp.dbo.z_replicain where status != 1 --Dnepr Vintage 192.168.70.2
order by replicaeventid

select * from [s-marketa].elitv_dp.dbo.t_PInP where PPID = 0 and prodid = 600226 

--лечение репликации добавляем вручную
--insert [s-marketa].elitv_dp.dbo.t_PInP
select * from [s-sql-d4].elitr.dbo.t_PInP where PPID = 0 and prodid = 600226