--Кто использует tempdb
use tempdb

--размер базы tempdb
exec sp_spaceused

;WITH task_space_usage AS (
    -- SUM alloc/delloc pages
    SELECT session_id,
           request_id,
           SUM(internal_objects_alloc_page_count) AS alloc_pages,
           SUM(internal_objects_dealloc_page_count) AS dealloc_pages
    FROM sys.dm_db_task_space_usage WITH (NOLOCK)
    WHERE session_id <> @@SPID
    GROUP BY session_id, request_id
)
SELECT TSU.session_id,
       TSU.alloc_pages * 1.0 / 128 AS [internal object MB space],
       TSU.dealloc_pages * 1.0 / 128 AS [internal object dealloc MB space],
       EST.text,
       -- Extract statement from sql text
       ISNULL(
           NULLIF(
               SUBSTRING(
                 EST.text, 
                 ERQ.statement_start_offset / 2, 
                 CASE WHEN ERQ.statement_end_offset < ERQ.statement_start_offset 
                  THEN 0 
                 ELSE( ERQ.statement_end_offset - ERQ.statement_start_offset ) / 2 END
               ), ''
           ), EST.text
       ) AS [statement text],
       EQP.query_plan
FROM task_space_usage AS TSU
INNER JOIN sys.dm_exec_requests ERQ WITH (NOLOCK)
    ON  TSU.session_id = ERQ.session_id
    AND TSU.request_id = ERQ.request_id
OUTER APPLY sys.dm_exec_sql_text(ERQ.sql_handle) AS EST
OUTER APPLY sys.dm_exec_query_plan(ERQ.plan_handle) AS EQP
WHERE EST.text IS NOT NULL OR EQP.query_plan IS NOT NULL
ORDER BY 3 DESC;


-- просмотреть подключеных пользователей к текущей базы
DECLARE @DBID int, @SPID int, @Cmd varchar(8000) 
SELECT db_name(dbid) as db_name,spid,loginame, status,hostname, program_name, nt_domain, nt_username,login_time, last_batch, * 
	FROM master.dbo.sysprocesses sp WHERE dbid=(SELECT database_id FROM master.sys.databases where name = db_name() and name <> 'master' )
	
	
--SELECT db_name(dbid) as db_name,spid,loginame, status,hostname, program_name, nt_domain, nt_username,login_time, last_batch,  * FROM master.dbo.sysprocesses sp

--2017-08-21-23.55
/*
database_name                                                                                                                    database_size      unallocated space
-------------------------------------------------------------------------------------------------------------------------------- ------------------ ------------------
tempdb                                                                                                                           9810.63 MB         7710.38 MB

reserved           data               index_size         unused
------------------ ------------------ ------------------ ------------------
3448 KB            1320 KB            1768 KB            360 KB

session_id internal object MB space                internal object dealloc MB space        text                                                                                                                                                                                                                                                             statement text                                                                                                                                                                                                                                                   query_plan
---------- --------------------------------------- --------------------------------------- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

(строк обработано: 0)

db_name                                                                                                                          spid   loginame                                                                                                                         status                         hostname                                                                                                                         program_name                                                                                                                     nt_domain                                                                                                                        nt_username                                                                                                                      login_time              last_batch              spid   kpid   blocked waittype waittime             lastwaittype                     waitresource                                                                                                                                                                                                                                                     dbid   uid    cpu         physical_io          memusage    login_time              last_batch              ecid   open_tran status                         sid                                                                                                                                                                            hostname                                                                                                                         program_name                                                                                                                     hostprocess cmd              nt_domain                                                                                                                        nt_username                                                                                                                      net_address  net_library  loginame                                                                                                                         context_info                                                                                                                                                                                                                                                       sql_handle                                 stmt_start  stmt_end    request_id
-------------------------------------------------------------------------------------------------------------------------------- ------ -------------------------------------------------------------------------------------------------------------------------------- ------------------------------ -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------------------- ----------------------- ------ ------ ------- -------- -------------------- -------------------------------- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ------ ------ ----------- -------------------- ----------- ----------------------- ----------------------- ------ --------- ------------------------------ ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------- ---------------- -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------ ------------ -------------------------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ ------------------------------------------ ----------- ----------- -----------
tempdb                                                                                                                           51     pvm0                                                                                                                             sleeping                       S-ELIT-DP                                                                                                                        Среда Microsoft SQL Server Management Studio                                                                                                                                                                                                                                                                                                                                                       2017-08-21 23:30:42.687 2017-08-21 23:30:42.987 51     0      0       0x0000   0                    MISCELLANEOUS                                                                                                                                                                                                                                                                                     2      1      188         0                    2           2017-08-21 23:30:42.687 2017-08-21 23:30:42.987 0      0         sleeping                       0x2727BF880371F14CAC8F95E8115A2EA600000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 S-ELIT-DP                                                                                                                        Среда Microsoft SQL Server Management Studio                                                                                     5916        AWAITING COMMAND                                                                                                                                                                                                                                                                   D017C29BB03B TCP/IP       pvm0                                                                                                                             0x0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0x01000200CD2F8E30C0FDABE90300000000000000 0           0           0
tempdb                                                                                                                           72     pvm0                                                                                                                             runnable                       S-ELIT-DP                                                                                                                        Среда Microsoft SQL Server Management Studio - запрос                                                                                                                                                                                                                                                                                                                                              2017-08-21 22:21:06.677 2017-08-21 23:55:11.280 72     1740   0       0x0000   0                    SOS_SCHEDULER_YIELD                                                                                                                                                                                                                                                                               2      1      529         126                  3           2017-08-21 22:21:06.677 2017-08-21 23:55:11.280 0      0         runnable                       0x2727BF880371F14CAC8F95E8115A2EA600000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 S-ELIT-DP                                                                                                                        Среда Microsoft SQL Server Management Studio - запрос                                                                            5916        SELECT                                                                                                                                                                                                                                                                             D017C29BB03B TCP/IP       pvm0                                                                                                                             0x0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0x01000200BB73AC31C0FEABE90300000000000000 3176        -1          0

(строк обработано: 2)

*/

/*
USE [tempdb]

--Активные транзакции
DBCC OPENTRAN;

--сжать файлы базы [tempdb]
DBCC SHRINKFILE (tempdev,10000)
DBCC SHRINKFILE (tempdev2,5000)
DBCC SHRINKFILE (templog,1000)

DBCC SHRINKDATABASE ([tempdb])

*/