--Выборка товаров с ценой продажи ниже индикативной

SELECT 
      --m.SrcPosID,    
      --m.BarCode,    
      p.ProdID, p.UM, p.UAProdName as ProdName, p.Country, v.KursCC,                  
      mp.PriceMC*v.KursCC AS Цена_продажи, 
      --mp.PromoPriceCC AS NewPriceMoney, 
      --p.IndRetPriceCC*1.05+0.02 as newindikativ,
      p.IndRetPriceCC as Индикатив           
      ,mp.PLID as Прайс
      --,*
      FROM r_Prods p  
      INNER JOIN r_ProdMP mp ON mp.ProdID = p.ProdID
       AND mp.PLID in (28,40,45,48,70,72,84,83,86)--Только актуальные прайслисты         
      INNER JOIN r_ProdMQ mq ON mq.ProdID = p.ProdID AND mq.Um = p.Um 
      INNER JOIN r_Currs v ON v.CurrID=mp.CurrID
      WHERE mp.PriceMC > 0 --AND mp.PromoPriceCC < mp.PriceMC 
       --AND dbo.zf_GetDate(GETDATE()) BETWEEN (mp.BDate) AND mp.EDate 
       AND mp.InUse = 1  
      --AND p.ProdID = 603303 --603734 
      AND mp.PriceMC*v.KursCC < p.IndRetPriceCC*1
      ORDER BY   mp.PLID, p.ProdID
      
/*
--select * from  iv_PrintPriceList
152.600000000
select plid from r_ProdMP group by plid
					72 48 71
23-02-2017					
ProdID	UM	ProdName	Country	KursCC	Цена_продажи	Индикатив	Прайс
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	28
600126	пляш	Феймос Граус Віскі 0,7л в тубусі	Шотландія	1.000000000	209.6000000000000	210.000000000	28
600255	пляш	Біфітер Джин 0,75л	Англія	1.000000000	213.2400000000000	264.375000000	28
600392	пляш	Бакарді Ром Суперіор 1л з мадлером	Німеччина	1.000000000	281.0400000000000	300.000000000	28
603152	пляш	Бакарді Ром Суперіор 150 років 1л в тубусі	Німеччина	1.000000000	235.6500000000000	300.000000000	28
603425	пак	Набір подарунковий Ханки Банністер Віскі шотл бленд Оріджинал 1л + Ханки Банністер Віскі шотл бленд Оріджинал 0,2л	Шотландiя	1.000000000	233.5000000000000	360.000000000	28
603612	пляш	Талламор дью Віскі 1л	Ірландiя	1.000000000	285.3500000000000	300.000000000	28
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	40
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	45
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	48
600081	пляш	Маріо Вермут Бьянко 0,75л	Україна	1.000000000	34.5600000000000	45.000000000	48
600126	пляш	Феймос Граус Віскі 0,7л в тубусі	Шотландія	1.000000000	209.6000000000000	210.000000000	48
600392	пляш	Бакарді Ром Суперіор 1л з мадлером	Німеччина	1.000000000	292.9200000000000	300.000000000	48
603152	пляш	Бакарді Ром Суперіор 150 років 1л в тубусі	Німеччина	1.000000000	235.6500000000000	300.000000000	48
603278	пляш	Дюарс Віскі Вайт Лейбл 1л	Шотландія	1.000000000	251.5500000000000	300.000000000	48
603425	пак	Набір подарунковий Ханки Банністер Віскі шотл бленд Оріджинал 1л + Ханки Банністер Віскі шотл бленд Оріджинал 0,2л	Шотландiя	1.000000000	233.5000000000000	360.000000000	48
603612	пляш	Талламор дью Віскі 1л	Ірландiя	1.000000000	285.3500000000000	300.000000000	48
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	70
600255	пляш	Біфітер Джин 0,75л	Англія	1.000000000	213.2400000000000	264.375000000	70
600392	пляш	Бакарді Ром Суперіор 1л з мадлером	Німеччина	1.000000000	281.0400000000000	300.000000000	70
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	72
600081	пляш	Маріо Вермут Бьянко 0,75л	Україна	1.000000000	34.5600000000000	45.000000000	72
600392	пляш	Бакарді Ром Суперіор 1л з мадлером	Німеччина	1.000000000	292.9200000000000	300.000000000	72
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	83
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	84
600080	пляш	Маріо Вермут Бьянко 0,5л	Україна	1.000000000	28.9200000000000	30.000000000	86
600392	пляш	Бакарді Ром Суперіор 1л з мадлером	Німеччина	1.000000000	292.9200000000000	300.000000000	86					
*/