--Выборка товаров с Акционной ценой продажи ниже индикативной

SELECT 
      --m.SrcPosID,    
      --m.BarCode,    
      p.ProdID, p.UM, p.UAProdName as ProdName, --p.Country,                   
      mp.PriceMC*v.KursCC AS Цена_продажи, 
      mp.PromoPriceCC AS Цена_акционная, 
      --p.IndRetPriceCC*1 as minprice,
      p.IndRetPriceCC  as Индикатив           
      ,mp.PLID  as Прайс
      --,*
      FROM r_Prods p  
      INNER JOIN r_ProdMP mp ON mp.ProdID = p.ProdID
		 AND mp.PLID in (28,40,45,48,70,72,83,84,85,86)--Только актуальные прайслисты        
      INNER JOIN r_ProdMQ mq ON mq.ProdID = p.ProdID AND mq.Um = p.Um 
      INNER JOIN r_Currs v ON v.CurrID=mp.CurrID
      WHERE mp.PromoPriceCC > 0 AND mp.PromoPriceCC < mp.PriceMC 
      AND dbo.zf_GetDate(GETDATE()) BETWEEN (mp.BDate) AND mp.EDate 
      AND mp.InUse = 1  
      --AND p.ProdID = 600077  
      --AND p.ProdID in (600080,600159,602505) 
      AND mp.PromoPriceCC < p.IndRetPriceCC*1
      ORDER BY   mp.PLID, p.ProdID
      
/*
--select * from  iv_PrintPriceList
152.600000000
select plid from r_ProdMP group by plid
					72 48 71
23-02-2017	
ProdID	UM	ProdName	Цена_продажи	Цена_акционная	Индикатив	Прайс
600082	пляш	Маріо Вермут Бьянко 0,25л	30.9000000000000	13.500000000	15.000000000	40
603561	пляш	Таврія Коньяк VS 0,5л	132.1000000000000	101.900000000	119.900000000	40
600080	пляш	Маріо Вермут Бьянко 0,5л	28.9200000000000	20.500000000	30.000000000	45
603070	пляш	Грін Дей Горілка 0,5л	84.3000000000000	67.800000000	69.780000000	48
603072	пляш	Грін Дей Горілка 0,7л	118.0000000000000	94.100000000	97.692000000	48
603073	пляш	Грін Дей Горілка Кленова 0,7л	118.0000000000000	97.400000000	97.692000000	48
801490	пляш	Солод Настоянка Баварський темний 0,5л	80.3000000000000	66.800000000	69.780000000	48
801491	пляш	Солод Горілка особлива Шотландський білий 0,5л	80.3000000000000	66.800000000	69.780000000	48
603070	пляш	Грін Дей Горілка 0,5л	84.3000000000000	67.800000000	69.780000000	72
603072	пляш	Грін Дей Горілка 0,7л	118.0000000000000	94.100000000	97.692000000	72
603073	пляш	Грін Дей Горілка Кленова 0,7л	118.0000000000000	97.400000000	97.692000000	72
801490	пляш	Солод Настоянка Баварський темний 0,5л	80.3000000000000	66.800000000	69.780000000	72
801491	пляш	Солод Горілка особлива Шотландський білий 0,5л	80.3000000000000	66.800000000	69.780000000	72
600082	пляш	Маріо Вермут Бьянко 0,25л	30.9000000000000	13.500000000	15.000000000	83
603561	пляш	Таврія Коньяк VS 0,5л	132.1000000000000	101.900000000	119.900000000	83
603561	пляш	Таврія Коньяк VS 0,5л	132.1000000000000	101.900000000	119.900000000	86					
*/