EXEC master..xp_cmdshell  'powershell.exe "Get-CimInstance -ClassName CIM_Processor";'
EXEC master..xp_cmdshell  'systeminfo'
--EXEC master..xp_cmdshell  'winsat cpu -v'
/*
exec sp_configure 'show advanced',1
reconfigure with override
go
exec sp_configure 'xp_cmdshell',1
reconfigure with override
go

-----------------------------------S-SQL-D4-------------------------------------
[01]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
	Intel(R) Xeon(R) CPU E5-2660 0 @ 2.20GHz
	Intel(R) Xeon(R) CPU E5-2665 0 @ 2.40GHz

NULL
Имя узла:                         S-SQL-D4
Название ОС:                      Microsoft Windows Server 2012 R2 Standard
Версия ОС:                        6.3.9600 Н/Д построение 9600
Изготовитель ОС:                  Microsoft Corporation
Параметры ОС:                     Рядовой сервер
Построение ОС:                    Multiprocessor Free
Зарегистрированный владелец:      Пользователь Windows
Зарегистрированная организация:   
Код продукта:                     00252-70000-00000-AA668
Дата установки:                   03.02.2015, 19:53:24
Время загрузки системы:           21.01.2020, 23:17:27
Изготовитель системы:             VMware, Inc.
Модель системы:                   VMware Virtual Platform
Тип системы:                      x64-based PC
Процессор(ы):                     Число процессоров - 6.
                                  [01]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
                                  [02]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
                                  [03]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
                                  [04]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
                                  [05]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
                                  [06]: Intel64 Family 6 Model 45 Stepping 7 GenuineIntel ~2294 МГц
Версия BIOS:                      Phoenix Technologies LTD 6.00, 21.09.2015
Папка Windows:                    C:\Windows
Системная папка:                  C:\Windows\system32
Устройство загрузки:              \Device\HarddiskVolume1
Язык системы:                     ru;Русский
Язык ввода:                       ru;Русский
Часовой пояс:                     (UTC+02:00) Вильнюс, Киев, Рига, София, Таллин, Хельсинки
Полный объем физической памяти:   36 864 МБ
Доступная физическая память:      1 470 МБ
Виртуальная память: Макс. размер: 44 308 МБ
Виртуальная память: Доступна:     7 723 МБ
Виртуальная память: Используется: 36 585 МБ
Расположение файла подкачки:      C:\pagefile.sys
Домен:                            corp.local
Сервер входа в сеть:              Н/Д
Исправление(я):                   Число установленных исправлений - 134.
                                  [01]: KB2868626
                                  [02]: KB2883200
                                  [03]: KB2887595
                                  [04]: KB2894852
                                  [05]: KB2894856
                                  [06]: KB2896496
                                  [07]: KB2903939
                                  [08]: KB2911106
                                  [09]: KB2919355
                                  [10]: KB2919394
                                  [11]: KB2920189
                                  [12]: KB2928680
                                  [13]: KB2934514
                                  [14]: KB2934520
                                  [15]: KB2938066
                                  [16]: KB2954879
                                  [17]: KB2955164
                                  [18]: KB2958262
                                  [19]: KB2959626
                                  [20]: KB2961072
                                  [21]: KB2961908
                                  [22]: KB2962409
                                  [23]: KB2962806
                                  [24]: KB2965500
                                  [25]: KB2966826
                                  [26]: KB2966828
                                  [27]: KB2967917
                                  [28]: KB2968296
                                  [29]: KB2971203
                                  [30]: KB2972103
                                  [31]: KB2972213
                                  [32]: KB2973114
                                  [33]: KB2973351
                                  [34]: KB2973448
                                  [35]: KB2975061
                                  [36]: KB2975719
                                  [37]: KB2976627
                                  [38]: KB2977765
                                  [39]: KB2978041
                                  [40]: KB2978122
                                  [41]: KB2978126
                                  [42]: KB2979573
                                  [43]: KB2979576
                                  [44]: KB2984006
                                  [45]: KB2989930
                                  [46]: KB2993100
                                  [47]: KB2995004
                                  [48]: KB2995388
                                  [49]: KB2996799
                                  [50]: KB2998174
                                  [51]: KB3000483
                                  [52]: KB3000850
                                  [53]: KB3003057
                                  [54]: KB3004365
                                  [55]: KB3008923
                                  [56]: KB3011780
                                  [57]: KB3012199
                                  [58]: KB3013126
                                  [59]: KB3013769
                                  [60]: KB3013816
                                  [61]: KB3014029
                                  [62]: KB3014442
                                  [63]: KB3019978
                                  [64]: KB3021674
                                  [65]: KB3022777
                                  [66]: KB3023266
                                  [67]: KB3034348
                                  [68]: KB3035126
                                  [69]: KB3042058
                                  [70]: KB3042085
                                  [71]: KB3044374
                                  [72]: KB3045685
                                  [73]: KB3045755
                                  [74]: KB3045999
                                  [75]: KB3046017
                                  [76]: KB3055642
                                  [77]: KB3059317
                                  [78]: KB3061512
                                  [79]: KB3071756
                                  [80]: KB3077715
                                  [81]: KB3081320
                                  [82]: KB3082089
                                  [83]: KB3084135
                                  [84]: KB3086255
                                  [85]: KB3092601
                                  [86]: KB3102939
                                  [87]: KB3109103
                                  [88]: KB3109560
                                  [89]: KB3110329
                                  [90]: KB3126041
                                  [91]: KB3126434
                                  [92]: KB3126587
                                  [93]: KB3126593
                                  [94]: KB3133043
                                  [95]: KB3138910
                                  [96]: KB3138962
                                  [97]: KB3139398
                                  [98]: KB3139914
                                  [99]: KB3146723
                                  [100]: KB3155784
                                  [101]: KB3156059
                                  [102]: KB3159398
                                  [103]: KB3161949
                                  [104]: KB3162343
                                  [105]: KB3172729
                                  [106]: KB3173424
                                  [107]: KB3175024
                                  [108]: KB3178539
                                  [109]: KB4012213
                                  [110]: KB4015547
                                  [111]: KB4019213
                                  [112]: KB4022717
                                  [113]: KB4025333
                                  [114]: KB4034672
                                  [115]: KB4038793
                                  [116]: KB4041687
                                  [117]: KB4048961
                                  [118]: KB4054522
                                  [119]: KB4056898
                                  [120]: KB4074597
                                  [121]: KB4088879
                                  [122]: KB4093115
                                  [123]: KB4103715
                                  [124]: KB4284878
                                  [125]: KB4338824
                                  [126]: KB4343888
                                  [127]: KB4457143
                                  [128]: KB4462941
                                  [129]: KB4467703
                                  [130]: KB4471322
                                  [131]: KB4480964
                                  [132]: KB4486474
                                  [133]: KB4487028
                                  [134]: KB4487000
Сетевые адаптеры:                 Число сетевых адаптеров - 1.
                                  [01]: vmxnet3 Ethernet Adapter
                                        Имя подключения: Ethernet
                                        DHCP включен:    Нет
                                        IP-адрес
                                        [01]: 10.1.0.155
Требования Hyper-V:               Обнаружена низкоуровневая оболочка. Функции, необходимые для Hyper-V, отображены не будут.
NULL
*/